uhnp/src/Enums/СтатусыЭтаповПроизводства2_2/СтатусыЭтаповПроизводства2_2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЭтаповПроизводства2_2</name>
  <enumValues>
    <name>Формируется</name>
  </enumValues>
  <enumValues>
    <name>Сформирован</name>
  </enumValues>
  <enumValues>
    <name>КВыполнению</name>
  </enumValues>
  <enumValues>
    <name>Начат</name>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/СтатусыЭтаповПроизводства2_2/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список выбора статуса документа
//
// Параметры:
//  ДанныеВыбора - СписокЗначений - заполняемый список значений.
//  УстановленныйСтатус - ПеречислениеСсылка.СтатусыЭтаповПроизводства2_2 - текущий статус документа
Процедура ЗаполнитьСписокВыбора(ДанныеВыбора, УстановленныйСтатус) Экспорт
	
	ДанныеВыбора.Очистить();
	
	ДанныеВыбора.Добавить(Перечисления.СтатусыЭтаповПроизводства2_2.Формируется);
	ДанныеВыбора.Добавить(Перечисления.СтатусыЭтаповПроизводства2_2.Сформирован);
	ДанныеВыбора.Добавить(Перечисления.СтатусыЭтаповПроизводства2_2.КВыполнению);
	ДанныеВыбора.Добавить(Перечисления.СтатусыЭтаповПроизводства2_2.Начат);
	ДанныеВыбора.Добавить(Перечисления.СтатусыЭтаповПроизводства2_2.Завершен);
	
	Если ДанныеВыбора.НайтиПоЗначению(УстановленныйСтатус) = Неопределено Тогда
		
		ДанныеВыбора.Добавить(УстановленныйСтатус, УстановленныйСтатус);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
